{
	"name": "Narthex",
	"generalDescription": "You stand in a dusty, empty, square room, the size of a large 
	walk-in wardrobe. The floor is ice-cold marble caked in inches of fine gray particles. 
	The prints of hundreds or thousands of bare feet criss cross the room. Mysterious piles 
	sit in shadow in each corner of the room. You hear a murmur of soft voices whispering 
	from all directions and impossible to fathom. The walls are tessellated with dirty 
	ceramic tiles. On each tile is inscribed with words. In the center of one of the walls 
	is a freshly painted wooden door with a brass handle.",
	"hotSpots": {
		"hotSpot": {
			"row": "100",
			"col": "100",
			"type": "loot",
			"description": "In this corner is a pile of rusty broadswords, daggers, and axes. 
			But one small knife looks clean and sharp.",
			"item": {
				"name": "small knife",
				"description": "A small steel knife, sharp but not worthy of a name.",
				"hitPoints": "10",
				"slot": "sword"
			},
		},
		"hotSpot": {
			"row": "100",
			"col": "100",
			"type": "loot",
			"description": "In this corner is a pile of tarnished brass chain mail. But one 
			coat of tightly ringed mail with leather straps looks new and ready to wear.",
			"item": {
				"name": "ringed mail",
				"description": "A coat of tightly ringed brass mail with leather straps, well worn.",
				"hitPoints": "100",
				"slot": "chest"
			},
		},
		"hotSpot": {
			"row": "100",
			"col": "100",
			"type": "loot",
			"description": "In this corner is a pile of dented brass helms. But one shiny 
			skullcap looks like it might fit you.",
			"item": {
				"name": "shiny skullcap",
				"description": "A shiny brass skullcap with just a few minor dents and bloodstains.",
				"hitPoints": "50",
				"slot": "head"
			},
		},
		"hotSpot": {
			"row": "100",
			"col": "100",
			"type": "loot",
			"description": "In this corner is a pile of splintered wooden shields. But one 
			wooden buckler with brass fittings looks light and sturdy enough to be worth taking.",
			"item": {
				"name": "wooden buckler",
				"description": "A light and sturdy wooden buckler with brass fittings.",
				"hitPoints": "50",
				"slot": "sheild"
			},
		},
		"hotSpot": {
			"row": "100",
			"col": "100",
			"type": "puzzel",
			"description": "The tiles on the bulwark before you cover the wall without making a 
			rational pattern. At least not one that you can perceive. It’s as if the tiles have 
			been scrambled. Printed on each tile is a word. Some are even in a language you 
			understand.",
			"item": {
				"name": "wooden buckler",
				"description": "A light and sturdy wooden buckler with brass fittings.",
				"hitPoints": "50",
				"slot": "sheild"
			},
		},
	}
}